In [12]:
#Create dependancies 
import pandas as pd 
import numpy as np
import matplotlib as pylt 
import os

In [13]:
#Read in the Excel file and view the headers
Lawful_df = pd.read_excel("./Resources/fy2018_Lawful.xlsx", header=4)
Lawful_df.head()

  Characteristic      Total    Female      Male Unknown
0            AGE        NaN       NaN       NaN     NaN
1          Total  1096611.0  584426.0  512176.0       9
2   Under 1 year     2959.0    1472.0    1487.0       -
3   1 to 4 years    34215.0   16976.0   17239.0       -
4   5 to 9 years    61533.0   30098.0   31433.0       2

In [14]:
#Use the iloc function to locate the point of interest in a data set
Broad_age = Lawful_df.iloc[19:23,:]
Broad_age

       Characteristic      Total    Female      Male Unknown
19              Total  1096611.0  584426.0  512176.0       9
20     Under 16 years   177300.0   86839.0   90458.0       3
21     16 to 20 years    85830.0   42113.0   43715.0       2
22  21 years and over   833481.0  455474.0  378003.0       4

In [15]:
#View the characteristic and Total columns 
Broad_age_df = pd.DataFrame(Broad_age)
Sex = Broad_age_df.iloc[:, 0:2]
Sex

       Characteristic      Total
19              Total  1096611.0
20     Under 16 years   177300.0
21     16 to 20 years    85830.0
22  21 years and over   833481.0

In [16]:
#Rename your columns 
Cleaned = Sex.rename(columns={"Characteristic": "Age", "Total": "Lawful 2018"})
Index_age = Cleaned.set_index("Age")
Index_age

                   Lawful Permanent Resident 2018
Age
Total                                   1096611.0
Under 16 years                           177300.0
16 to 20 years                            85830.0
21 years and over                        833481.0

In [17]:
#View a single row 
Sex = Lawful_df.iloc[19,1:]
Sex.to_frame(name="LPR 2018")

            LPR 2018
Total    1.09661e+06
Female        584426
Male          512176
Unknown            9

In [18]:
#Use the iloc function to locate the point of interest in a data set
Marital_status = Lawful_df.iloc[24:30,:]
Marital_status

        Characteristic      Total    Female      Male Unknown
24               Total  1096611.0  584426.0  512176.0       9
25             Married   627443.0  342625.0  284816.0       2
26              Single   400196.0  191733.0  208457.0       6
27             Widowed    26579.0   23446.0    3133.0       -
28  Divorced/separated    32416.0   22045.0   10371.0       -
29             Unknown     9977.0    4577.0    5399.0       1

In [19]:
#View the characteristic and Total columns 
New_marital_df = pd.DataFrame(Marital_status)
Specific = New_marital_df.iloc[:, 0:2]
Specific

        Characteristic      Total
24               Total  1096611.0
25             Married   627443.0
26              Single   400196.0
27             Widowed    26579.0
28  Divorced/separated    32416.0
29             Unknown     9977.0

In [20]:
#Rename your columns 
Renamed = Specific.rename(columns={"Characteristic": "Marital Status", "Total": "Lawful Permanent Resident 2018"})
Renamed.head()

        Marital Status  Lawful Permanent Resident 2018
24               Total                       1096611.0
25             Married                        627443.0
26              Single                        400196.0
27             Widowed                         26579.0
28  Divorced/separated                         32416.0

In [21]:
#View a single column 
Status = Lawful_df.iloc[24:30,0:2]
Name18 = Status.rename(columns={"Characteristic": "Marital Status", "Total": "Lawful 2018"})
#Set marital status as index for clarity
Name18.set_index("Marital Status", inplace=True)
Name18

                    Lawful 2018
Marital Status
Total                 1096611.0
Married                627443.0
Single                 400196.0
Widowed                 26579.0
Divorced/separated      32416.0
Unknown                  9977.0